NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B840F1024GM64.svd
        <register>
          <name>PRSTVAL2</name>
          <description>Preset Value for High Speed and SDR12 Modes</description>
          <addressOffset>0x064</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC7FFC7FF</resetMask>
          <fields>
            <field>
              <name>HSPSDCLKFREQVAL</name>
              <description>SD_CLK Frequency Select Value for High Speed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSPCLKGENVAL</name>
              <description>Clock Generator Select Value for High Speed</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSPDRVSTVAL</name>
              <description>Driver Strength Select Value for High Speed</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is selected (Default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is selected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is selected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is selected</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDR12SDCLKFREQVAL</name>
              <description>SD_CLK Frequency Select Value for SDR12</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDR12CLKGENVAL</name>
              <description>Clock Generator Select Value for SDR12</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDR12DRVSTVAL</name>
              <description>Driver Strength Select Value for SDR12</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is selected (Default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is selected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is selected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is selected</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTVAL4</name>
          <description>Preset Value for SDR25 and SDR50 Modes</description>
          <addressOffset>0x068</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC7FFC7FF</resetMask>
          <fields>
            <field>
              <name>SDR25SDCLKFREQVAL</name>
              <description>SD_CLK Frequency Select Value for SDR25</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDR25CLKGENVAL</name>
              <description>Clock Generator Select Value for SDR25</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDR25DRVSTVAL</name>
              <description>Driver Strength Select Value for SDR25</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is selected (Default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is selected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is selected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is selected</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDR50SDCLKFREQVAL</name>
              <description>SD_CLK Frequency Select Value for SDR50</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDR50CLCKGENVAL</name>
              <description>Clock Generator Select Value for SDR50</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDR50DRVSTVAL</name>
              <description>Driver Strength Select Value for SDR50</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is selected (Default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is selected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is selected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is selected</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTVAL6</name>
          <description>Preset Value for SDR104 and DDR50 Modes</description>
          <addressOffset>0x06C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC7FFC7FF</resetMask>
          <fields>
            <field>
              <name>SDR104SDCLKFREQVAL</name>
              <description>SD_CLK Frequency Select Value for SDR104</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDR104CLKGENVAL</name>
              <description>Clock Generator Select Value for SDR104</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDR104DRVSTVAL</name>
              <description>Driver Strength Select Value for SDR104</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is selected (Default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is selected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is selected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is selected</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDR50SDCLKFREQVAL</name>
              <description>SD_CLK Frequency Select Value for DDR50</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DDR50CLKGENVAL</name>
              <description>Clock Generator Select Value for DDR50</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DDR50DRVSTVAL</name>
              <description>Driver Strength Select Value for DDR50</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is selected (Default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is selected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is selected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is selected</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTTOCTRL</name>
          <description>Boot Timeout Control Register</description>
          <addressOffset>0x070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTDATTOCNT</name>
              <description>Boot Data Timeout Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOTINTSTAT</name>
          <description>Slot Interrupt Status Register</description>
          <addressOffset>0x0FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10020000</resetValue>
          <resetMask>0xFFFF0001</resetMask>
          <fields>
            <field>
              <name>INTSLOT0</name>
              <description>Interrupt Signal for Slot#0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPECVERNUM</name>
              <description>Host Controller Compliant Spec Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VENDVERNUM</name>
              <description>Vendor Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Core Control Signals</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00030FFF</resetMask>
          <fields>
            <field>
              <name>ITAPDLYEN</name>
              <description>Selective Tap Delay Line Enable on Rxclk_in</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITAPDLYSEL</name>
              <description>Selects One of 32 Taps on the Rxclk_in Line</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITAPCHGWIN</name>
              <description>Gating Signal for Tap Delay Change</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTAPDLYEN</name>
              <description>Selective Tap Delay Line Enable on SDIO_CLK Pin</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTAPDLYSEL</name>
              <description>Selects One of 32 Taps on the SDIO_CLK Pin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDLYMUXSEL</name>
              <description>TX Delay Mux Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG0</name>
          <description>Core Configuration 0</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>TUNINGCNT</name>
              <description>Tuning Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUTCLKFREQ</name>
              <description>Timeout Clock Frequency</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUTCLKUNIT</name>
              <description>Timeout Clock Unit in kHz or MHz</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASECLKFREQ</name>
              <description>Base Clock Frequency for SD_CLK</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXBLKLEN</name>
              <description>MAX Block Length of Transfer</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>512B</name>
                  <description>512 Bytes are Selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024B</name>
                  <description>1024 Bytes are Selected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048B</name>
                  <description>2048 Bytes are Selected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C8BITSUP</name>
              <description>8-bit Interface Support</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CADMA2SUP</name>
              <description>ADMA2 Mode Support</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHSSUP</name>
              <description>High Speed Mode Support</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSDMASUP</name>
              <description>SDMA Mode Support</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSUSPRESSUP</name>
              <description>Suspend/Resume Support</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C3P3VSUP</name>
              <description>Core 3P3V Support</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C3P0VSUP</name>
              <description>3P0V Support</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C1P8VSUP</name>
              <description>1P8V Support</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
